<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");

require_once __DIR__ . '/bitrix/routing_index.php';

/**
 * TODO:
 * 0) удаление рецепта
 * 0.1) удаление картинки
 * 0.1_1) пофиксить вёрстку - замена фильтра
 * 0.2) рефакторинг добавления и изменения
 * 1) просматривание чужого профиля /profile/:id/
 * 2) комментарии
 * 3) поиск пользователя по имени или нику
 * 4) лайки
 * 5) подписки
 *
 * 8) безопасность и локализация
 */
?>


<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>